import mysql.connector
from config import DB_CONFIG

def insert_products():
    try:
        # 建立資料庫連線
        conn = mysql.connector.connect(**DB_CONFIG)
        cursor = conn.cursor()

        # 商品資料
        products = [
            ("喵喵過聖誕禮盒", 
             "伯爵蜜薑米餅乾 8入；核桃可可米餅乾 8入；堅果抹茶米餅乾 8入；義式椒鹽米餅乾 8入；焙茶米雪球 5入", 20),
            ("入口即化米雪球（含堅果）", 
             "米雪球是一種入口即化，濃而不膩的小西點看似一顆硬脆的球球，其實有著柔軟的內心", 50),
            ("愈嚼愈香米餅乾（含堅果及牛奶）", 
             "我是餅乾，不是米餅，也不是米干（ ˊ・◡・ˋ ）罐裝是可愛的迷你圖案，一口一片剛剛好！", 50),
            ("牛皮紙提袋", 
             "✿響應環保並未提供提袋，需要的朋友請加購✿", 50),
        ]
        
        # 商品細節
        products_detail = [
            (1, "禮盒特選餅乾與雪球（口味詳情請見上方）", "禮盒（約220g±5%）", 520),
            (2, "靜岡抹茶", "小罐14顆（約140g±5%）", 250),
            (2, "靜岡抹茶", "大罐24顆（約240g±5%）", 380),
            (2, "蜜香紅茶", "小罐14顆（約140g±5%）", 250),
            (2, "蜜香紅茶", "大罐24顆（約240g±5%）", 380),
            (2, "法芙娜可可", "小罐14顆（約140g±5%）", 250),
            (2, "法芙娜可可", "大罐24顆（約240g±5%）", 380),
            (2, "張豐盛花生", "小罐14顆（約140g±5%）", 250),
            (2, "張豐盛花生", "大罐24顆（約240g±5%）", 380),
            (2, "張豐盛芝麻", "小罐14顆（約140g±5%）", 250),
            (2, "張豐盛芝麻", "大罐24顆（約240g±5%）", 380),
            (2, "✿限定✿焙茶", "小罐14顆（約140g±5%）", 250),
            (2, "✿限定✿焙茶", "大罐24顆（約240g±5%）", 380),
            (2, "✿隱藏版✿椒鹽", "小罐14顆（約140g±5%）", 250),
            (2, "✿隱藏版✿椒鹽", "大罐24顆（約240g±5%）", 380),
            (3, "堅果抹茶", "小罐約25-30片（約120g±5%）", 360),
            (3, "堅果抹茶", "大罐約35-40片（約160g±5%）", 480),
            (3, "核桃可可", "小罐約25-30片（約120g±5%）", 360),
            (3, "核桃可可", "大罐約35-40片（約160g±5%）", 480),
            (3, "✿限定✿伯爵蜜薑", "小罐約25-30片（約120g±5%）", 360),
            (3, "✿限定✿伯爵蜜薑", "大罐約35-40片（約160g±5%）", 480),
            (3, "✿隱藏版✿義式椒鹽", "小罐約25-30片（約120g±5%）", 360),
            (3, "✿隱藏版✿義式椒鹽", "大罐約35-40片（約160g±5%）", 480),
            (4, "牛皮紙袋", "高28cm x 寬19cm x 底寬10cm", 480)
        ]

        # 插入商品
        insert_query = """
        INSERT INTO products (name, description, stock) 
        VALUES (%s, %s, %s)
        """
        cursor.executemany(insert_query, products)
        
        # 插入商品細節
        insert_query = """
        INSERT INTO product_details (product_id, flavor, size, price) 
        VALUES (%s, %s, %s, %s)
        """
        cursor.executemany(insert_query, products_detail)
        
        # 提交變更
        conn.commit()
        print("商品初始化成功！")

    except mysql.connector.Error as err:
        print(f"初始化商品錯誤: {err}")
    
    finally:
        if conn.is_connected():
            cursor.close()
            conn.close()

if __name__ == '__main__':
    insert_products()
